Repository: juliano-lopes/virtual-notes-for-NVDA
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt_br

source: Virtual Notes For NVDA
pt_br: Notas virtuais para o NVDA

source: Add a new temporary note to memory
pt_br: Adicionar uma nova nota temporária à memória

source: No text selected
pt_br: Nenhum texto selecionado

source: Go to the next note
pt_br: Ir para a próxima nota

source: Go to the previous note
pt_br: Ir para a nota anterior

source: Anounce the current note
pt_br: Anunciar a nota atual

source: Delete the note in the current position
pt_br: Excluir a nota na posição atual

source: Replace the note in the current position (you need to select some text first)
pt_br: Substituir a nota na posição atual (você precisa selecionar algum texto primeiro)

source: Move to the next line of the current note
pt_br: Mover para a próxima linha da nota atual

source: Move to the previous line of the current note
pt_br: Mover para a linha anterior da nota atual

source: Anounce the current line of the current note
pt_br: Anunciar a linha atual da nota atual

source: Paste the current note to the current application
pt_br: Colar a nota atual no aplicativo atual

source: Paste the current line in the note to the current application
pt_br: Colar a linha atual da nota no aplicativo atual

source: Virtual Notes For NVDA (creates virtual notes to be read by NVDA)
pt_br: Notas Virtuais para o NVDA (cria notas virtuais para serem lidas pelo NVDA)

source: This add-on (Virtual Notes for NVDA) creates virtual notes that can be read by NVDA screen reader. Here are the available steps: * Select text; * Use shortcuts to perform the following actions: * NVDA + Alt + A: Add a new temporary note to memory; * NVDA + Alt + J: Go to the previous note; * NVDA + Alt + L: Go to the next note; * NVDA + Alt + U: Announce the current note; * NVDA + CONTROL + SHIFT + U: Paste the current note to the current application; * NVDA + Alt + S: Replace the note in the current position (you need to select some text first); * NVDA + Alt + D: Delete the note in the current position. If the current note contains multiple lines (like text copied from a text editor), you can use these shortcuts: * NVDA + Alt + I: Move to the previous line of the current note; * NVDA + Alt + K: Move to the next line of the current note; * NVDA + Alt + O: Announce the current line of the current note; * NVDA + CONTROL + SHIFT + O: Paste the current line in the note to the current application. Note: The key positions mimic the arrow keys (I = up, L = right, K = down, and J = left). After using a shortcut, a specific sound will play to indicate the action performed.
pt_br: vEste complemento, Notas Virtuais para o NVDA (Virtual Notes for NVDA) adiciona textos à memória do computador que você pode utilizá-los como notas virtuais para serem lidas pelo leitor de telas NVDA. Aqui estão as etapas disponíveis: * Selecionar algum texto; * Use os seguintes atalhos: * NVDA + Alt + a: Adicionar o texto selecionado como uma nova nota temporária à memória; * NVDA + Alt + J: ir para a nota anterior; *NVDA + Alt + L: ir para a próxima nota; * NVDA + Alt + U: anunciar a nota atual; * NVDA + CONTROL + SHIFT + U: Colar a nota corrente no aplicativo atual. * NVDA + Alt + S: Substituir a nota na posição atual (é preciso selecionar algum texto primeiro); * NVDA + Alt + D: Excluir a nota da posição atual. Se a nota atual contiver várias linhas (como texto copiado de um editor de texto), use os seguintes atalhos: * NVDA + Alt + I: Mover para a linha anterior da nota atual; * NVDA + Alt + K: Mover para a próxima linha da nota atual; * NVDA + Alt + O: Anunciar a linha atual da nota atual. * NVDA + CONTROL + SHIFT + O: Colar a linha atual da nota no aplicativo atual. Nota: As posições das teclas são similares as setas do teclado (I = para cima, L = para a direita, K = para baixo e J = para a esquerda). Depois de usar um atalho, um som específico será reproduzido para indicar a ação realizada.
